AI4CFD_export/freecad_addon/AI4CFD/vendor/CfdOF/Data/TestFiles/cases/ViscousTubeBundle/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0 0.0 0.0);

boundaryField
{

    inlet
    {
        // Fix all three components of velocity on inflow and only the normal component on outflow,
        // in order to be well-posed if there are some faces on the patch which are actually outflows.
        type                fixedNormalInletOutletVelocity;
        fixTangentialInflow yes;
        normalVelocity
        {
            type            fixedValue;
            value           uniform ( 1.0 0.0 0.0 );
        }
        value               uniform ( 1.0 0.0 0.0 );
    }

    outlet
    {
        type        pressureInletOutletVelocity;
        value       $internalField;
    }

    wall
    {
        // movingWallVelocity reduces to fixedValue if the mesh is not moving
        type        movingWallVelocity;
        value       uniform (0 0 0);
    }

    defaultFaces
    {
        type        slip;
        value       $internalField;
    }

    MeshRefinement001
    {
        type        empty;
    }

    MeshRefinement001BackFace
    {
        type        empty;
    }

}

// ************************************************************************* //
